flat_plate_ext_lowvis_delta/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    zeroGradientPlanes
    {
        type            patch;
        nFaces          180;
        startFace       9440;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       9620;
    }
    plate
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       9660;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          9600;
        startFace       9760;
    }
)

// ************************************************************************* //
