flat_plate_ext_lowvis_delta/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    zeroGradientPlanes
    {
        type            zeroGradient;
    }

    plate
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
//    rightSide
//    {
//    type            zeroGradient;
//
//    }
    

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
